#include<stdio.h>
main()
{
	int a[3], * p;
	p = a;

	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p・・・%d\n\n",*p);
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p・・・%d\n\n", *p+1);
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	p = a;
	printf("*p・・・%d\n\n", *(p+1));
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	p = a;
	printf("*p・・・%d\n\n", *p+=1);
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	p = a;
	printf("*p・・・%d\n\n", *p++);//後置きは他の処理が先に行われる
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	p = a;
	printf("*p・・・%d\n\n", (*p)++);//後置きは他の処理が先に行われる
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p・・・%d\n\n", *++p);//前置きは先に計算が行われる
	p = a;
	a[0] = 10, a[1] = 20, a[2] = 30;
	printf("*p・・・%d\n\n", ++*p);//前置きは先に計算が行われる
}